Repository: eugener68/Spotify_Playlist_Creation
Catalog: ios/Sources/AppFeature/Resources/*.lproj/Localizable.strings
Languages: ru

# flow.sign_in
source: Sign In
ru: Вход

# flow.settings
source: Settings
ru: Настр.

# flow.build
source: Build
ru: Сборка

# flow.results
source: Results
ru: К списку

# builder.default_playlist_name
source: My Playlist
ru: Мой плейлист

# builder.spotify_account_title
source: Spotify Account
ru: Аккаунт Spotify

# builder.apple_music_account_title
source: Apple Music Account
ru: Аккаунт Apple Music

# builder.latest_build_title
source: Latest Build
ru: Последняя сборка

# builder.upload_order_title
source: Upload Order
ru: Порядок загрузки

# builder.empty_results_title
source: No Builds Yet
ru: Сборки пока отсутствуют

# builder.empty_results_description
source: Run the builder to preview your playlist.
ru: Запустите сборщик, чтобы увидеть предварительный плейлист.

# builder.building_button
source: Building…
ru: Выполняется…

# builder.run_button
source: Run Playlist Build
ru: Запустить сборку плейлиста

# builder.playlist_name_label
source: Playlist Name:
ru: Название плейлиста:

# builder.playlist_name_placeholder
source: Playlist name
ru: Название плейлиста

# builder.date_stamp_toggle
source: Date stamp name
ru: Добавить дату в название

# builder.dry_run_toggle
source: Dry run
ru: Пробный запуск

# builder.manual_artist_list_title
source: Manual Artist List
ru: Список исполнителей вручную

# builder.manual_artist_hint
source: Separate artists with commas or new lines.
ru: Разделяйте исполнителей запятыми или переводами строки.

# builder.import_csv_button
source: Import Artist List CSV/Text
ru: Импортировать список исполнителей (CSV/текст)

# builder.paste_button
source: Paste Artist List
ru: Вставить список исполнителей

# builder.settings_title
source: Settings
ru: Настройки

# builder.limit_per_artist_title
source: Limit Per Artist
ru: Треков на исполнителя

# builder.limit_per_artist_subtitle
source: Number of top tracks to fetch per artist. Max is 10.
ru: Сколько треков на каждого исполнителя. Максимум 10.

# builder.max_tracks_title
source: Max Tracks
ru: Всего треков в плейлисте

# builder.max_tracks_subtitle
source: Cap the total tracks before upload. Max is 250.
ru: Максимальное количество треков 250.

# builder.shuffle_title
source: Shuffle Results
ru: Перемешать треки

# builder.shuffle_subtitle
source: Randomize order using a deterministic seed.
ru: Смешанный порядок исполнения треков

# builder.prefer_original_title
source: Prefer Original Versions
ru: Предпочитать оригинальные версии

# builder.prefer_original_subtitle
source: Favor non-remastered mixes when available.
ru: Отдавайте предпочтение оригинальным (не ремастер, не ремикс) версиям, если они доступны.

# settings.language_title
source: Interface Settings
ru: Язык интерфейса

# settings.language_system
source: System Language
ru: Системный

# settings.language_english
source: English
ru: Английский

# settings.language_russian
source: Russian
ru: Русский

# settings.dark_mode_title
source: Dark Mode
ru: Тёмная тема

# settings.dark_mode_subtitle
source: Override the app to always use a dark appearance.
ru: Всегда использовать тёмную тему в приложении.

# results.updated_existing
source: Updated existing playlist
ru: Обновлён существующий плейлист

# results.created_new
source: Created new playlist
ru: Создан новый плейлист

# results.prepared_uploaded
source: Prepared: %lld • Uploaded: %lld
ru: Подготовлено: %lld • Загружено: %lld

# auth.status_checking
source: Checking existing session…
ru: Проверяем текущую сессию…

# auth.status_signing_in
source: Waiting for Spotify sign-in…
ru: Ожидание входа в Spotify…

# auth.cancel
source: Cancel
ru: Отменить

# auth.signed_in
source: Signed in
ru: Вход выполнен

# auth.open_dashboard
source: Open Spotify App/Dashboard
ru: Открыть приложение/кабинет Spotify

# auth.sign_out
source: Sign out
ru: Выйти

# auth.sign_in
source: Sign in with Spotify
ru: Войти через Spotify

# auth.unavailable
source: Authentication unavailable in this build.
ru: Авторизация недоступна в этой сборке.

# apple_music_auth.status_checking
source: Checking Apple Music access…
ru: Проверяем доступ к Apple Music…

# apple_music_auth.status_connecting
source: Connecting to Apple Music…
ru: Подключаемся к Apple Music…

# apple_music_auth.connected
source: Connected
ru: Подключено

# apple_music_auth.connect
source: Connect Apple Music
ru: Подключить Apple Music

# apple_music_auth.sign_out
source: Sign out
ru: Выйти

# apple_music_auth.unavailable
source: Apple Music is unavailable in this build.
ru: Apple Music недоступен в этой сборке.

# apple_music_auth.storefront
source: Storefront: %@
ru: Витрина: %@

# artist_input.clipboard_empty
source: Clipboard is empty.
ru: Буфер обмена пуст.

# artist_input.clipboard_none
source: No new artists detected in clipboard.
ru: Новых исполнителей в буфере обмена не найдено.

# artist_input.import_permission_denied
source: Import failed: permission was denied for %@.
ru: Не удалось импортировать: нет доступа к %@.

# artist_input.import_could_not_read
source: Could not read %@.
ru: Не удалось прочитать %@.

# artist_input.import_none_in_file
source: No new artists found in %@.
ru: Новых исполнителей в %@ не найдено.

# artist_input.import_failed
source: Import failed: %@.
ru: Ошибка импорта: %@.

# artist_input.suggestions_title
source: Suggestions
ru: Подсказки

# artist_input.suggestions_empty
source: Keep typing to see Spotify matches.
ru: Продолжайте вводить, чтобы увидеть исполнителей Spotify.

# artist_input.suggestions_auth_required
source: Sign in with Spotify to enable suggestions.
ru: Войдите в Spotify, чтобы включить подсказки.

# artist_input.suggestions_error_generic
source: Could not load suggestions. Check your connection and try again.
ru: Не удалось загрузить подсказки. Проверьте подключение и повторите попытку.

# artist_input.suggestion_followers
source: %@ followers
ru: %@ подписчиков

# artist_input.ai_title
source: DJ AI
ru: Диджей ИИ

# artist_input.ai_prompt_placeholder
source: Describe the mood/vibe, task, genre, era, language, or similar artists… Example: focus music, minimal lyrics, electronic, 2010s–present
ru: Опишите настроение/вайб, задачу, жанр, годы, язык или похожих исполнителей… Пример: музыка для фокуса, минимум слов, электронная, 2010-е — сейчас

# artist_input.ai_generate_button
source: Ask DJ AI
ru: Спросить Диджея ИИ

# artist_input.ai_add_all_button
source: Add all to artist list
ru: Добавить всех в список

# artist_input.ai_suggestions_title
source: DJ AI suggestions
ru: Подсказки Диджей ИИ

# artist_input.ai_suggestions_empty
source: Enter a prompt to generate artists.
ru: Введите промпт, чтобы получить список исполнителей.

# artist_input.ai_error_generic
source: Could not generate artists.
ru: Не удалось сгенерировать исполнителей.

# djai.paywall_title
source: Unlock DJ AI
ru: Открыть Диджей ИИ

# djai.paywall_subtitle
source: Free trial periods available (duration depends on plan), then choose a plan. Cancel anytime.
ru: Доступны бесплатные пробные периоды (длительность зависит от плана), затем выберите план. Можно отменить в любое время.

# djai.paywall_lifetime_header
source: Lifetime
ru: Навсегда

# djai.paywall_lifetime_detail
source: One-time purchase. Unlocks DJ AI feature.
ru: Разовая покупка. Открывает функцию Диджей ИИ.

# djai.paywall_restore
source: Restore purchases
ru: Восстановить покупки

# djai.paywall_manage
source: Manage subscriptions
ru: Управление подписками

# djai.paywall_no_plans
source: Plans are unavailable right now. Check your internet connection, product IDs, and App Store Connect status.
ru: Планы сейчас недоступны. Проверьте интернет, идентификаторы продуктов и статус в App Store Connect.

# djai.paywall_disclaimer
source: Subscriptions renew automatically unless canceled at least 24 hours before the end of the current period.
ru: Подписка продлевается автоматически, если её не отменить минимум за 24 часа до конца текущего периода.

# djai.paywall_trial_hint
source: Includes free trial (duration depends on plan)
ru: Включает пробный период (длительность зависит от плана)

# djai.paywall_cancel_anytime
source: Cancel anytime
ru: Отмена в любое время

# djai.paywall_close
source: Close
ru: Закрыть

# djai.status_locked
source: Status: Locked
ru: Статус: Закрыто

# djai.status_subscribed
source: Status: Active subscription
ru: Статус: Подписка активна

# djai.status_lifetime
source: Status: Lifetime access
ru: Статус: Доступ навсегда

# djai.plan_weekly
source: DJ AI — Weekly
ru: Диджей ИИ — Недельная

# djai.plan_monthly
source: DJ AI — Monthly
ru: Диджей ИИ — Месячная

# djai.plan_yearly
source: DJ AI — Yearly
ru: Диджей ИИ — Годовая

# djai.plan_lifetime
source: DJ AI — Lifetime
ru: Диджей ИИ — Навсегда

# djai.plan_founders_lifetime
source: DJ AI — Founders Lifetime
ru: Диджей ИИ — Для первых покупателей

# about.title
source: About
ru: О приложении

# about.developer
source: Developer
ru: Разработчик

# about.support
source: Support / Feedback
ru: Поддержка

# about.contact_us
source: Contact Us
ru: Связаться

# about.version_build
source: Version
ru: Версия

# about.copyright
source: Copyright
ru: Авторские права
